Neel-729/DeskDroid/firmware/esp32/src/app/application.cpp
      case STATE_REMINDER_LIST:
        AppNavigation::enter(STATE_REMINDER_EDIT);
        break;

      case STATE_REMINDER_EDIT:
        RemindersFeature::advanceEditField();
        AppNavigation::markChanged();
        break;

      case STATE_SETTINGS_HOME:
        AppNavigation::enter(STATE_SETTINGS_MENU);
        break;

      case STATE_SETTINGS_MENU:
        SettingsFlow::beginEdit();
        break;

      case STATE_SETTINGS_EDIT:
        SettingsFlow::advanceField();
        break;

      default:
        break;
    }

    AudioService::beep(40);
  }

  if(ev==EVENT_DOUBLE_CLICK){
    switch(AppNavigation::current()){
      case STATE_REMINDER_EDIT:
        RemindersFeature::save();
        AppNavigation::enter(STATE_REMINDER_LIST);
        break;

      case STATE_REMINDER_LIST:
        AppNavigation::enter(STATE_REMINDER_HOME);
        AudioService::beep(80);
        break;

      case STATE_SETTINGS_EDIT:
        SettingsFlow::commitEdit(now);
        break;

      case STATE_SETTINGS_MENU:
        SettingsFlow::leaveMenu();
        break;

      case STATE_SETTINGS_HOME:
        SettingsFlow::exitToClock();
        break;

      case STATE_TIMER_VIEW:
        // === DOUBLE-CLICK FIXED: Implemented state-specific double-click behavior
        // Double click handling per timer state (exact spec):
        // - IDLE: Enter Edit mode
        // - RUNNING: Pause + Reset
        // - PAUSED: Reset
        // - COMPLETE: Reset + Return to home
        if(TimerFeature::isIdle()){
          // IDLE: Enter Edit mode (only state that enters edit on double click)
          TimerFeature::enterEditing();
          AppNavigation::enter(STATE_TIMER_EDIT);
        } else if(TimerFeature::isRunning()){
          // RUNNING: Pause + Reset
          TimerFeature::enterPaused(now);
          TimerFeature::confirmReset();
          AppNavigation::markChanged();
          AudioService::beep(40);
        } else if(TimerFeature::isPaused()){
          // PAUSED: Reset
          TimerFeature::confirmReset();
          AppNavigation::markChanged();
          AudioService::beep(40);
        } else if(TimerFeature::isComplete()){
          // COMPLETE: Reset + Return to home (clock screen)
          TimerFeature::confirmReset();
          AppNavigation::enter(STATE_CLOCK);
          AppNavigation::markChanged();
          AudioService::beep(40);
        }
        break;

      case STATE_TIMER_EDIT:
        // === DOUBLE-CLICK FIXED: EDITING: Save & Return to Paused/IDLE
        // Double click in editing: save and exit to timer view state
        TimerFeature::exitEditing();
        AppNavigation::enter(STATE_TIMER_VIEW);
        AppNavigation::markChanged();
        break;

      case STATE_STOPWATCH:
        {
          // Double click handling per stopwatch state (exact spec):
          // - IDLE: Do nothing
          // - RUNNING: Reset
          // - PAUSED: Reset
          const auto& stopwatch = SystemStateStore::current().stopwatch;
          if (stopwatch.state == StopwatchStateValue::RUNNING || stopwatch.state == StopwatchStateValue::PAUSED) {
            StopwatchFeature::reset();
            AppNavigation::markChanged();
            AudioService::beep(40);
          }
          // IDLE state: do nothing as required
        }
        break;

      default:
        break;
    }
  }

  if(ev==EVENT_LONG_PRESS){
    switch(AppNavigation::current()){
      case STATE_REMINDER_LIST:
        RemindersFeature::toggleSelectedActive();
        RemindersFeature::save();
        AppNavigation::markChanged();
        break;

      case STATE_TIMER_VIEW:
        // Long press in view state: reset timer if running or paused
        if(TimerFeature::isRunning() || TimerFeature::isPaused()){
          TimerFeature::confirmReset();
        }
        break;

      case STATE_TIMER_EDIT:
        // Long press in editing: cancel changes and exit to view state
        TimerFeature::exitEditing();
        AppNavigation::enter(STATE_TIMER_VIEW);
        break;

      case STATE_STOPWATCH:
        {
          // Long press handling per stopwatch state (exact spec):
          // - IDLE: Return to home screen
          // - RUNNING: Reset and return to home screen
          // - PAUSED: Reset and return to home screen
          const auto& stopwatch = SystemStateStore::current().stopwatch;
          if (stopwatch.state == StopwatchStateValue::RUNNING || stopwatch.state == StopwatchStateValue::PAUSED) {
            // If running or paused, first reset then go home
            StopwatchFeature::reset();
          }
          // Always return to home screen on long press, regardless of state
          AppNavigation::goHome();
          AudioService::beep(200); // Distinct beep for long press home
        }
        break;

      case STATE_TIMER_ALARM:
        resetTimerAlarm(true);
        break;

      case STATE_SETTINGS_EDIT:
        SettingsFlow::commitEdit(now);
        SettingsFlow::exitToClock();
        break;

      case STATE_SETTINGS_MENU:
      case STATE_SETTINGS_HOME:
        SettingsFlow::save();
        LightingService::refreshSchedule(settings);
        SettingsFlow::exitToClock();
        break;

      default:
        break;
    }
    AudioService::beep(120);
  }
}

bool processEvents(unsigned long now){
  bool processed = false;
  AppEvent event;
  while(dequeueEvent(event)){
    processed = true;
    Services::handleEvent(event, now);
    handleEvent(event, now);
  }
  return processed;
}

bool sameUiRows(const char* row0, const char* row1){
  return lastUiFrameValid &&
    strncmp(lastFlushedRows[0], row0, 16) == 0 &&
    strncmp(lastFlushedRows[1], row1, 16) == 0;
}

void rememberUiRows(const char* row0, const char* row1){
  strncpy(lastFlushedRows[0], row0, 16);
  strncpy(lastFlushedRows[1], row1, 16);
  lastFlushedRows[0][16] = '\0';
  lastFlushedRows[1][16] = '\0';
  lastUiFrameValid = true;
}

void flushUiFrame(){
  (void)flushUiFrame(false);
}

bool flushUiFrame(bool force){
  const char* row0 = UiScreens::row(0);
  const char* row1 = UiScreens::row(1);
  if(!force && sameUiRows(row0, row1)){
    uiTiming.unchangedFrames++;
    return false;
  }

  HardwareRequests::writeDisplayRows(row0, row1);
  rememberUiRows(row0, row1);
  uiTiming.framesFlushed++;
  return true;
}

